### 1. Импорт библиотек

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from scipy import stats
import statsmodels.api as sm
import seaborn as sns
import warnings 

warnings.filterwarnings("ignore")
%matplotlib inline
plt.style.use("ggplot")
plt.rcParams["figure.figsize"] = (8, 8)

### 2. Загрузка данных

В папке с нашими данными присутствуют акции отдельных компаний, но нас интересует датасет со всеми компаниями, поэтому загрузим именно его

In [4]:
df = pd.read_csv(r"C:\Users\Sergei\Desktop\datasets\all_stocks_2006-01-01_to_2018-01-01.csv")
df.head()

         Date   Open   High    Low  Close   Volume Name
0  2006-01-03  77.76  79.35  77.24  79.11  3117200  MMM
1  2006-01-04  79.49  79.49  78.25  78.71  2558000  MMM
2  2006-01-05  78.41  78.65  77.56  77.99  2529500  MMM
3  2006-01-06  78.64  78.90  77.64  78.63  2479500  MMM
4  2006-01-09  78.50  79.83  78.46  79.02  1845600  MMM

### 3. Разведочный анализ данных (EDA)

Посмотрим по внимательней на наши данные
1. **Date** - дата продажи/покупки трейдинга
2. **Open** - цена на момент открытия акции
3. **High** - самая высокая цена акции
4. **Low** - самая низкая цена акции
5. **Close** - цена на момент закрытия
6. **Volume** - объём проданных акции
7. **Name** - название компании

In [5]:
df.tail()

             Date   Open   High    Low  Close    Volume  Name
93607  2017-12-22  71.42  71.87  71.22  71.58  10979165  AABA
93608  2017-12-26  70.94  71.39  69.63  69.86   8542802  AABA
93609  2017-12-27  69.77  70.49  69.69  70.06   6345124  AABA
93610  2017-12-28  70.12  70.32  69.51  69.82   7556877  AABA
93611  2017-12-29  69.79  70.13  69.43  69.85   6613070  AABA

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93612 entries, 0 to 93611
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    93612 non-null  object
 1   Open    93587 non-null  float64
 2   High    93602 non-null  float64
 3   Low     93592 non-null  float64
 4   Close   93612 non-null  float64
 5   Volume  93612 non-null  int64
 6   Name    93612 non-null  object
dtypes: float64(4), int64(1), object(2)
memory usage: 5.0+ MB

Проверим данные на отсутствующие значения

In [7]:
df.isna().sum()

Date       0
Open      25
High      10
Low       20
Close      0
Volume     0
Name       0
dtype: int64

In [8]:
np.round(df.isna().sum() * 100 / len(df), 3)

Date      0.000
Open      0.027
High      0.011
Low       0.021
Close     0.000
Volume    0.000
Name      0.000
dtype: float64

Воспользуемся

In [9]:
df.interpolate(inplace = True)

In [10]:
np.round(df.isna().sum() * 100 / len(df), 3)

Date      0.0
Open      0.0
High      0.0
Low       0.0
Close     0.0
Volume    0.0
Name      0.0
dtype: float64